scripts/artillery/registration.yml
config:
  target: 'http://localhost:3000/api/v1'
  phases:
    - duration: 10
      arrivalRate: 15
      rampTo: 30
      name: Warm up
    - duration: 15
      arrivalRate: 30
      rampTo: 75
      name: Ramp up (level 1)
    - duration: 30
      arrivalRate: 120
      name: Ramp up (level 2)

scenarios:
  - name: 'user-registration'
    flow:
      - post:
          url: '/users/registration'
          json:
            email: 'artillery-user+{{ $randomNumber(1,10000000000) }}@example.com'
            password: 'myS3cretP@55w0rd!'